In [65]:
import pandas as pd

df = pd.read_csv("sampleDataset.csv")

print(df.shape)
df.head()

(110, 6)

   id   age    salary        city department  score
0   1  56.0   38392.0   Bhaktapur  Marketing  72.22
1   2  46.0   60535.0    Lalitpur         IT  59.60
2   3  32.0  108603.0     Pokhara         IT  89.67
3   4  25.0       NaN  Biratnagar  Marketing  56.29
4   5  38.0  119135.0   Kathmandu         IT  97.92

In [66]:
import warnings
warnings.simplefilter(action='ignore', category=FutureWarning)

# Check how many missing values per column
missing_counts = df.isnull().sum()
print("Missing values per column:")
print(missing_counts)

print()
# If there are missing values
if missing_counts.any():
    # Example strategies:
    # For numeric columns: fill with mean
    numeric_cols = df.select_dtypes(include=["int64", "float64"]).columns
    for col in numeric_cols:
        if df[col].isnull().sum() > 0:
            mean_value = df[col].mean()
            df[col].fillna(mean_value, inplace=True)
            print(f"Filled missing values in '{col}' with mean: {mean_value:.2f}")

    # For categorical columns: fill with mode
    categorical_cols = df.select_dtypes(include=["object"]).columns
    for col in categorical_cols:
        if df[col].isnull().sum() > 0:
            mode_value = df[col].mode()[0]
            df[col].fillna(mode_value, inplace=True)
            print(f"Filled missing values in '{col}' with mode: {mode_value}")

# Verify no missing values remain
print("\nMissing values after handling:")
print(df.isnull().sum())

Missing values per column:
id            0
age           8
salary        8
city          8
department    0
score         9
dtype: int64

Filled missing values in 'age' with mean: 37.90
Filled missing values in 'salary' with mean: 80384.90
Filled missing values in 'score' with mean: 69.18
Filled missing values in 'city' with mode: Kathmandu

Missing values after handling:
id            0
age           0
salary        0
city          0
department    0
score         0
dtype: int64